[net]
batch=1
weight_threshold=0.005
data_threshold=0.4
height=299
width=299
channels=3

[data]
test=test.lst
labels=labels.lst
weight=weights/resnet.wgh
top=1

#stem
[convolutional]
#         32,  1,149,149,  3,  3,  3,  0,  0,  1,  2,
batch_normalize=1
filters=32
size=3
stride=2
padding=0
activation=relu

[convolutional]
#         32,  1,147,147, 32,  3,  3,  0,  0,  1,  1,
batch_normalize=1
filters=32
size=3
stride=1
padding=0
activation=relu

[convolutional]
#         64,  1,147,147, 32,  3,  3,  0,  0,  1,  1,
batch_normalize=1
filters=64
size=3
stride=1
padding=1
activation=relu

[convolutional]
#         96,  1, 73, 73, 64,  3,  3,  0,  0,  1,  2,
batch_normalize=1
filters=96
size=3
stride=2
padding=0
activation=relu

[maxpool]
size=3
stride=2
padding=0
hops=2

[concat]
hops=1,2

#branch 1
[convolutional]
#         64,  1, 73, 73,160,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=64
size=1
stride=1
padding=0
activation=relu

[convolutional]
#         64,  1, 73, 73, 64,  7,  1,  0,  0,  1,  1,
batch_normalize=1
filters=64
size=7
stride=1
padding=3
activation=relu

[convolutional]
#         64,  1, 73, 73, 64,  1,  7,  0,  0,  1,  1,
batch_normalize=1
filters=64
size=7
stride=1
padding=3
activation=relu

[convolutional]
#         96,  1, 71, 71, 64,  3,  3,  0,  0,  1,  1,
batch_normalize=1
filters=96
size=3
stride=1
padding=0
activation=relu

#branch 2
[convolutional]
#         64,  1, 73, 73,160,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=64
size=1
stride=1
padding=0
hops=5
activation=relu

[convolutional]
#         96,  1, 71, 71, 64,  3,  3,  0,  0,  1,  1,
batch_normalize=1
filters=96
size=3
stride=1
padding=0
activation=relu

[concat]
hops=1,3

[maxpool]
size=3
stride=2
padding=0

[convolutional]
#        192,  1, 35, 35,192,  3,  3,  0,  0,  1,  2, 
batch_normalize=1
filters=192
size=3
stride=2
padding=0
hops=2
activation=relu

[concat]
hops=1,2

#Inception-A-1
#branch 1
[convolutional]
#         64,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=64
size=1
stride=1
padding=0
activation=relu

[convolutional]
#         96,  1, 35, 35, 64,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

[convolutional]
#         96,  1, 35, 35, 96,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

#branch 2
[convolutional]
#         64,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=64
size=3
stride=1
padding=1
hops=4
activation=relu

[convolutional]
#         96,  1, 35, 35, 64,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

#branch 3
[convolutional]
#         96,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=1
stride=1
padding=0
hops=6
activation=relu

#branch 4
[avgpool]
size=3
stride=1
padding=1
hops =7

[convolutional]
#         96,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,6

#Inception-A-2
#branch 1
[convolutional]
#         64,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=64
size=1
stride=1
padding=0
activation=relu

[convolutional]
#         96,  1, 35, 35, 64,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

[convolutional]
#         96,  1, 35, 35, 96,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

#branch 2
[convolutional]
#         64,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=64
size=3
stride=1
padding=1
hops=4
activation=relu

[convolutional]
#         96,  1, 35, 35, 64,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

#branch 3
[convolutional]
#         96,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=1
stride=1
padding=0
hops=6
activation=relu

#branch 4
[avgpool]
size=3
stride=1
padding=1
hops =7

[convolutional]
#         96,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,6

#Inception-A-3
#branch 1
[convolutional]
#         64,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=64
size=1
stride=1
padding=0
activation=relu

[convolutional]
#         96,  1, 35, 35, 64,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

[convolutional]
#         96,  1, 35, 35, 96,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

#branch 2
[convolutional]
#         64,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=64
size=3
stride=1
padding=1
hops=4
activation=relu

[convolutional]
#         96,  1, 35, 35, 64,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

#branch 3
[convolutional]
#         96,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=1
stride=1
padding=0
hops=6
activation=relu

#branch 4
[avgpool]
size=3
stride=1
padding=1
hops =7

[convolutional]
#         96,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,6

#Inception-A-4
#branch 1
[convolutional]
#         64,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=64
size=1
stride=1
padding=0
activation=relu

[convolutional]
#         96,  1, 35, 35, 64,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

[convolutional]
#         96,  1, 35, 35, 96,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

#branch 2
[convolutional]
#         64,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=64
size=3
stride=1
padding=1
hops=4
activation=relu

[convolutional]
#         96,  1, 35, 35, 64,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=3
stride=1
padding=1
activation=relu

#branch 3
[convolutional]
#         96,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=1
stride=1
padding=0
hops=6
activation=relu

#branch 4
[avgpool]
size=3
stride=1
padding=1
hops =7

[convolutional]
#         96,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=96
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,6

#Reduction A
#Branch 1
[convolutional]
#        192,  1, 35, 35,384,  1,  1,  0,  0,  1,  1, 
batch_normalize=1
filters=192
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        224,  1, 35, 35,192,  3,  3,  0,  0,  1,  1, 
batch_normalize=1
filters=224
size=3
stride=1
padding=1
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  3,  3,  0,  0,  1,  2, 
batch_normalize=1
filters=256
size=3
stride=2
padding=0
activation=relu

#Branch 2
[convolutional]
#       384,  1, 17, 17, 384,  3,  3,  0,  0,  1,  2,
batch_normalize=1
filters=384
size=3
stride=2
padding=0
hops=4
activation=relu
 
[maxpool]
size=3
stride=2
padding=0
hops=5

[concat]
hops=1, 2, 3

#Inception-B-1
#branch 1
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        192,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=192
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17, 192,  7,  1,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17,224,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch 2
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
hops=6
activation=relu

[convolutional]
#        224,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch3
[convolutional]
#        384,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
hops=9
activation=relu

#brach 4
[avgpool]
size=3
stride=1
padding=1
hops=10

[convolutional]
#        128,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=128
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,7

#Inception-B-2
#branch 1
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        192,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=192
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17, 192,  7,  1,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17,224,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch 2
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
hops=6
activation=relu

[convolutional]
#        224,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch3
[convolutional]
#        384,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
hops=9
activation=relu

#brach 4
[avgpool]
size=3
stride=1
padding=1
hops=10

[convolutional]
#        128,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=128
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,7

#Inception-B-3
#branch 1
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        192,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=192
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17, 192,  7,  1,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17,224,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch 2
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
hops=6
activation=relu

[convolutional]
#        224,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch3
[convolutional]
#        384,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
hops=9
activation=relu

#brach 4
[avgpool]
size=3
stride=1
padding=1
hops=10

[convolutional]
#        128,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=128
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,7

#Inception-B-4
#branch 1
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        192,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=192
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17, 192,  7,  1,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17,224,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch 2
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
hops=6
activation=relu

[convolutional]
#        224,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch3
[convolutional]
#        384,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
hops=9
activation=relu

#brach 4
[avgpool]
size=3
stride=1
padding=1
hops=10

[convolutional]
#        128,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=128
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,7

#Inception-B-5
#branch 1
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        192,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=192
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17, 192,  7,  1,  0,  0,  1,  1, 
filters=224
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        224,  1, 17, 17,224,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch 2
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
hops=6
activation=relu

[convolutional]
#        224,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch3
[convolutional]
#        384,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
hops=9
activation=relu

#brach 4
[avgpool]
size=3
stride=1
padding=1
hops=10

[convolutional]
#        128,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=128
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,7

#Inception-B-6
#branch 1
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        192,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=192
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17, 192,  7,  1,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17,224,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch 2
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
hops=6
activation=relu

[convolutional]
#        224,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch3
[convolutional]
#        384,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
hops=9
activation=relu

#brach 4
[avgpool]
size=3
stride=1
padding=1
hops=10

[convolutional]
#        128,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=128
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,7

#Inception-B-7
#branch 1
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        192,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=192
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17, 192,  7,  1,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        224,  1, 17, 17,224,  1,  7,  0,  0,  1,  1, 
filters=224
size=1
stride=7
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch 2
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
hops=6
activation=relu

[convolutional]
#        224,  1, 17, 17,192,  1,  7,  0,  0,  1,  1, 
filters=224
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        256,  1, 17, 17,224,  7,  1,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

#branch3
[convolutional]
#        384,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
hops=9
activation=relu

#brach 4
[avgpool]
size=3
stride=1
padding=1
hops=10

[convolutional]
#        128,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=128
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,7

#Reduction-B
#branch 1
[convolutional]
#        256,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=256
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        256,  1, 17, 17, 256,  1,  7,  0,  0,  1,  1, 
filters=256
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        320,  1, 17, 17,256,  7,  1,  0,  0,  1,  1, 
filters=320
size=7
stride=1
padding=3
activation=relu

[convolutional]
#        320,  1,  8,  8,320,  3,  3,  0,  0,  1,  2, 
filters=320
size=3
stride=2
padding=0
activation=relu

#branch 2
[convolutional]
#        192,  1, 17, 17,1024,  1,  1,  0,  0,  1,  1, 
filters=192
size=1
stride=1
padding=0
hops=5
activation=relu

[convolutional]
#        192,  1,  8,  8,192,  3,  3,  0,  0,  1,  2, 
filters=192
size=3
stride=2
padding=0
activation=relu

#branch 3
[maxpool]
size=3
stride=2
padding=0
hops=7

[concat]
hops=1,2,4

#Inception-C-1
#branch 1
[convolutional]
#        384,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        448,  1,  8,  8,384,  1,  3,  0,  0,  1,  1, 
filters=448
size=3
stride=1
padding=1
activation=relu

[convolutional]
#        512,  1,  8,  8, 448,  3,  1,  0,  0,  1,  1, 
filters=512
size=3
stride=1
padding=1
activation=relu

#branch 1-a
[convolutional]
#        256,  1,  8,  8,512,  1,  3,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
activation=relu

#branch 1-b
[convolutional]
#        256,  1,  8,  8, 512,  3,  1,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
hops=2
activation=relu

#branch 2
[convolutional]
#        384,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
hops=6
activation=relu

#branch 2-a
[convolutional]
#        256,  1,  8,  8,384,  3,  1,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
activation=relu

#branch 2-b
[convolutional]
#        256,  1,  8,  8, 384,  1,  3,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
hops=2
activation=relu

#branch 3
[convolutional]
#        256,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=256
size=1
stride=1
padding=0
hops=9
activation=relu

#branch 4
[avgpool]
size=3
stride=1
padding=1
hops=10

[convolutional]
#        256,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=256
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,5,7,8

#Inception-C-2
#branch 1
[convolutional]
#        384,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        448,  1,  8,  8,384,  1,  3,  0,  0,  1,  1, 
filters=448
size=3
stride=1
padding=1
activation=relu

[convolutional]
#        512,  1,  8,  8, 448,  3,  1,  0,  0,  1,  1, 
filters=512
size=3
stride=1
padding=1
activation=relu

#branch 1-a
[convolutional]
#        256,  1,  8,  8,512,  1,  3,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
activation=relu

#branch 1-b
[convolutional]
#        256,  1,  8,  8, 512,  3,  1,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
hops=2
activation=relu

#branch 2
[convolutional]
#        384,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
hops=6
activation=relu

#branch 2-a
[convolutional]
#        256,  1,  8,  8,384,  3,  1,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
activation=relu

#branch 2-b
[convolutional]
#        256,  1,  8,  8, 384,  1,  3,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
hops=2
activation=relu

#branch 3
[convolutional]
#        256,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=256
size=1
stride=1
padding=0
hops=9
activation=relu

#branch 4
[avgpool]
size=3
stride=1
padding=1
hops=10

[convolutional]
#        256,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=256
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,5,7,8

#Inception-C-3
#branch 1
[convolutional]
#        384,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
activation=relu

[convolutional]
#        448,  1,  8,  8,384,  1,  3,  0,  0,  1,  1, 
filters=448
size=3
stride=1
padding=1
activation=relu

[convolutional]
#        512,  1,  8,  8, 448,  3,  1,  0,  0,  1,  1, 
filters=512
size=3
stride=1
padding=1
activation=relu

#branch 1-a
[convolutional]
#        256,  1,  8,  8,512,  1,  3,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
activation=relu

#branch 1-b
[convolutional]
#        256,  1,  8,  8, 512,  3,  1,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
hops=2
activation=relu

#branch 2
[convolutional]
#        384,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=384
size=1
stride=1
padding=0
hops=6
activation=relu

#branch 2-a
[convolutional]
#        256,  1,  8,  8,384,  3,  1,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
activation=relu

#branch 2-b
[convolutional]
#        256,  1,  8,  8, 384,  1,  3,  0,  0,  1,  1, 
filters=256
size=3
stride=1
padding=1
hops=2
activation=relu

#branch 3
[convolutional]
#        256,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=256
size=1
stride=1
padding=0
hops=9
activation=relu

#branch 4
[avgpool]
size=3
stride=1
padding=1
hops=10

[convolutional]
#        256,  1,  8,  8,1536,  1,  1,  0,  0,  1,  1, 
filters=256
size=1
stride=1
padding=0
activation=relu

[concat]
hops=1,3,4,5,7,8

[softmax]
groups=1

[cost]
type=l2
